export default {
  validates: {
    short: 'Пароль слишком короткий',
    long: 'Пароль слишком длинный',
    field: 'Заполните поле',
    least: 'Должен быть не менее ',
    email: 'Введите корректный email',
    max: 'Максимальное кол-во символов: ',
    min: 'Минимальная кол-во символов: ',
    login: 'Неправильный логин или пароль',
    register: 'Пользователь с таким email уже существует',
  },
  confirmForm: {
    darthVader: {
      first: 'Теперь ты',
      second: 'на тёмной стороне',
    },
    register: {
      first: 'Поздравляем,',
      second: 'теперь вы можете войти',
    },
    warning: {
      first: 'Вы уверены, что',
      second: 'хотите это сделать?',
    },
  },
  btn: {
    edit: 'Изменить',
    delete: 'Удалить',
    back: 'Назад',
    ok: 'OK',
    cancel: 'Отмена',
    search: 'Поиск',
    addTour: 'Добавить тур',
    editTour: 'Изменить тур',
    loadTours: 'Загрузить больше',
    bookNow: 'Заказать',
    logOut: 'Выйти',
    signIn: 'Войти',
    signUp: 'Регистрация',
  },
  role: {
    admin: 'admin',
    regular: 'regular',
  },
  form: {
    placeholder: 'Введите данные',
    titleInput: {
      name: 'Имя',
      category: 'Категория',
      desc: 'Описание',
      price: 'Цена',
      email: 'Email',
      password: 'Пароль',
      role: 'Роль',
    },
  },
  titleRoute: {
    tours: 'Туры',
    newTour: 'Добавление тура',
    editTour: 'Изменение тура',
    signIn: 'Вход в систему',
    signUp: 'Регистрация',
    dashboard: 'Личный кабинет',
    users: 'Пользователи',
    editUser: 'Изменение пользователя',
    error: 'Ошибка',
    notFound: 'Страница не найдена',
  },
  navbar: {
    helloMsg: 'Привет',
    homeItemTxt: 'Главная',
    toursItemTxt: 'Туры',
    newTourItemTxt: 'Создать',
    usersItemTxt: 'Пользователи',
    loginItemTxt: 'Войти',
    registerItemTxt: 'Регистрация',
    profileItemTxt: 'Личный кабинет',
  },
  startingBlock: {
    subtitleMsg: 'Выберите лучшее направление',
    titleMsgOne: 'Приключение',
    titleMsgTwo: 'Без границ',
    searchTxt: 'Найдите своё лучшее место...',
    searchButtonTxt: 'Поиск',
  },
  experienceBlock: {
    titleTxtOne: 'Опыт',
    titleTxtTwo: 'путешествия с нами',
    titleBoxTxt: {
      one: 'Исландия',
      two: 'Норвегия',
      three: 'Финляндия',
      four: 'Канада',
    },
    subtitleBoxTxt: 'Это отличная страна для путешествия для любых времён года. '
    + 'Здесь очень много привлекательный и захватывающих мест',
  },
  categoryBlock: {
    titleTxtOne: 'Выберите',
    titleTxtTwo: 'свою категорию',
    subtitleTxt: 'С другой стороны реализация намеченных плановых заданий позволяет '
    + 'оценить значение модели развития. Идейные соображения высшего порядка',
    categoryBoxTxt: {
      mountainTxt: 'Горы',
      waterfallTxt: 'Водопады',
      snowTxt: 'Снег',
      natureTxt: 'Природа',
    },
  },
  tripBlock: {
    titleTxtOne: 'Наша',
    titleTxtTwo: 'Приключенческая поездка',
    subtitleTxt: 'Маркус Сис и Флориан Ник изучают аудиовизуальные медиа в Университете '
    + 'Штутгарта в Германии. Их проект по итогам семестра представляет собой собранные в '
    + 'короткометражный фильм в разрешении 4K фотографии Исландии, в котором два молодых '
    + 'режиссера прославляют островное государство, заветную цель многих путешественников, '
    + 'фотографов и режиссеров — и все из-за уникальных пейзажей.',
  },
  clientsBlock: {
    titleTxtOne: 'Наши',
    titleTxtTwo: 'потрясающие клинты',
    subtitleTxt: 'Таким образом сложившаяся структура организации позволяет выполнять важные '
    + 'задания по разработке систем массового участия. Идейные соображения высшего порядка, '
    + 'а также реализация намеченных плановых заданий требуют от нас анализа систем массового '
    + 'участия. Товарищи!',
    clientsTxt: {
      one: 'Милана',
      two: 'Джош',
      three: 'Алекс',
      four: 'Чайна',
      five: 'Кия',
    },
    reviewTxt: {
      one: 'Понравилась четкая организация, подобраны интересные экскурсии, заселение '
      + 'в хорошем отеле, рекомендую всем для отдыха о котором не пожалеете',
      two: 'Добрый день, с 20 по 24 февраля был во Львове, поездка в первую очередь '
      + 'запомнилась потрясающей атмосферой этого города, обязательно поеду еще раз',
      three: 'Поездка прошла на "ура"!'
      + 'Дни пролетели незаметно, очень интересно прошло время и занимательно. '
      + 'Спасибо огромное организатору и гиду!',
      four: 'Ездила в Италию. Все сделали быстро и четко. Отели комфортные и близко к морю. 10 из 10',
      five: 'Огромное спасибо приложению “Anventure» за помощь в выборе тура в Париж: '
      + 'подробнейшие консультации, точная информация, все очень четко, грамотно, организованно.',
    },
  },
  feedbackBlock: {
    btnTxt: 'Заказать',
    inputTxt: 'Введить свой email',
    endTxt: 'НАЧНИТЕ ПРИКЛЮЧЕНИЕ ВМЕСТЕ С НАМИ',
  },
  footerBlock: {
    subtitleTxt: 'С другой стороны реализация намеченных плановых заданий позволяет '
    + 'оценить значение модели развития. Идейные соображения высшего порядка',
    columnTxt: {
      one: {
        title: 'Мероприятия',
        items: {
          one: 'Горный велосипед',
          two: 'Поход',
          three: 'Пункт назначения',
          four: 'Истории',
        },
      },
      two: {
        title: 'Бронирование',
        items: {
          one: 'Билеты',
          two: 'Туристический продукт',
          three: 'Пакеты',
          four: 'Проживание',
        },
      },
      three: {
        title: 'Контакты',
        items: {
          one: 'Работа',
          two: 'Команда',
          three: 'Туристический офис',
          four: 'Брошюры',
        },
      },
    },
    madeTxt: '© Все права защищены ADVENTO | Сделано с ♥ | 2020',
  },
  tours: {
    titleTxt: 'Список туров',
    searchTxt: 'Введите название тура',
    tableTxt: {
      name: 'Имя',
      category: 'Категория',
      desc: 'Описание',
      price: 'Цена',
      date: 'Дата',
    },
    btnLoadTxt: 'Загрузить больше',
    warningTxt: 'Ничего не найдено:(',
  },
  users: {
    titleTxt: 'Пользователи',
    nameTxt: 'Имя:',
    roleTxt: 'Роль:',
    emailTxt: 'Email:',
  },
  dashboard: {
    helloTxt: 'Добро пожаловать, ',
    nameTxt: 'Твоё имя:',
    roleTxt: 'Твоя роль:',
    emailTxt: 'Твой email:',
    logOutBtn: 'Выйти',
  },
  errorAndNotFound: {
    error: 'Ошибка',
    notFound: 'Страница не найдена',
  },
};
